# От sep до end

# Напишите программу, которая выводит числа от 1 до 5 в одной строке, разделяя их звездочками.
# Затем программа должна вывести сообщение "Конец программы." на той же строке после всех чисел.
# Используйте параметры sep и end в функции print().

# Напишите тут
print(1, 2, 3, 4, 5, sep="*", end=" ")
# for i in range(6):
#     print(i, sep="*", end="")
print("Конец программы.", end="")