# Возраст это только цифра

# Создайте переменную birth_year и присвойте ей ваш год рождения.
# Вычислите ваш возраст и сохраните его в переменную current_age. Выведите ее на экран.
birth_year = 1990
# Напишите тут ваш код
current_age = 2023 - birth_year
print(current_age)