# Экранирование

# Напишите программу, которая создает и выводит на экран строки:
# Строку с вложенными кавычками с использованием разных типов кавычек.
# Строку с вложенными кавычками с использованием экранирования.

# Напишите тут ваш код
str1 = 'Different "braces"'
str2 = "'Discovery' is a \"journal\""
print(str1)
print(str2)