# Палиндром

# Написать наивный метод для проверки, является ли строка палиндромом (читается одинаково в обоих направлениях).


def is_palindrome(s: str) -> bool:
# Напишите тут ваш код

# Пример использования:
example = "radar"
print(is_palindrome(example))  # True
