# Объединение массивов

# У тебя есть два отсортированных массива чисел, напиши код, который объединит их в один отсортированный массив.


def merge_sorted_arrays(arr1, arr2):
# Напишите тут ваш код


# Пример использования
arr1 = [1, 3, 5, 7]
arr2 = [2, 4, 6, 8]
merged_array = merge_sorted_arrays(arr1, arr2)
print(merged_array)  # Вывод: [1, 2, 3, 4, 5, 6, 7, 8]
