# Частота слов

# Напишите функцию для подсчета частоты каждого слова в тексте.
# Используйте оптимальную структуру данных для хранения частоты слов.

def word_frequency(text):
# Напишите тут ваш код

# Пример использования функции
text = "Напишите функцию для подсчета частоты каждого слова в тексте."
print(word_frequency(text))
