# Запаковка

# Напиши программу, которая содержит словарь, который содержит список, который содержит словарь, который содержит список, который содержит строку.

# Напишите тут ваш код
my_dict = {"some_list": [1, 2, {"new_list": ["a", "b"]}]}
print(my_dict)