# Семицветик

# Напишите программу, которая создает множество из 7 элементов - названий цветов (color).
# Программа должна вывести все элементы созданного множества на экран.

# Напишите тут ваш
color_set = {'red', 'green', 'blue', 'pink', 'black', 'white', 'yellow'}
print(color_set)