# Использование пакета cowsay

# Установите пакет cowsay и используйте его для отображения сообщения.
# Выполните следующие шаги:
# Установите пакет cowsay с помощью pip.
# Используйте пакет cowsay для отображения сообщения "Нужно было учить Python...".
# Удалите пакет cowsay с помощью pip.


# Установка пакета cowsay
# Напишите тут ваш код
# pip install cowsay
# Использование пакета cowsay для отображения сообщения
# Напишите тут ваш код
import cowsay
cowsay.cow("Нужно было учить Python...")
# Удаление пакета cowsay
# Напишите тут ваш код
# pip uninstall cowsay
