# Грокаем алгоритмы

# Выведите на экран текст "Кормен - красавчик, но читать я его конечно же не буду".

# Напишите тут ваш код
print("Кормен - красавчик, но читать я его конечно же не буду")
