# Математика 8 класса
# Напишите программу, которая запрашивает у пользователя число и
# использует библиотеку math для вычисления и вывода
# квадратного корня и факториала этого числа.
# Напишите тут ваш код
import math

number = int(input("Enter a number: "))
print(math.sqrt(number))
print(math.factorial(number))