# Сортировка вставками

# Напишите функцию, которая использует сортировку вставками для сортировки списка строк в алфавитном порядке.


def insertion_sort(strings):
# Напишите тут ваш код


# Пример использования:
strings = ["banana", "apple", "cherry", "date"]
sorted_strings = insertion_sort(strings)
print(sorted_strings)  # Output: ['apple', 'banana', 'cherry', 'date']
