# Суммаист

# Напишите программу, которая запрашивает у пользователя два числа, сохраняет их в переменные и выводит их сумму.
# Пример:
# Введите первое число: 5
# Введите второе число: 7
# Сумма: 12

# Напишите тут ваш код
a = int(input('Введите первое число: '))
b = int(input('Введите второе число: '))
print('Сумма:', a + b)