# Имя сестра, имя.

# Напишите программу, которая запрашивает у пользователя его имя и выводит приветственное сообщение.
# Пример:
# Введите ваше имя: Анна
# Привет, Анна!

# Напишите тут ваш код
name = input("Введите ваше имя: ")
print("Привет", name)