# Сортировка чисел

# Напишите функцию, которая использует сортировку выбором для сортировки списка чисел по возрастанию.


def selection_sort(arr):
# Напишите тут ваш код

# Пример использования
numbers = [64, 25, 12, 22, 11]
sorted_numbers = selection_sort(numbers)
print(sorted_numbers)  # Вывод: [11, 12, 22, 25, 64]
