# Подмассив

# Дан массив длинны n состоящий из целых чисел.
# Найти подмассив фиксированного размера k с максимальной суммой.


def max_subarray_sum(arr, k):
# Напишите тут ваш код

# Пример использования
arr = [1, 2, 3, 4, 5, 6, 7, 8, 9]
k = 3
print(max_subarray_sum(arr, k))  # Вывод: 24 (7 + 8 + 9)
