# Обращение к несуществующей переменной.

# Напиши программу, выполнение которой приводит к исключению NameError.

# Напишите тут ваш код
print(name)
