# Welcome

# Создайте переменную name и присвойте ей ваше имя.
# Выведите сообщение "Привет, {имя}" используя функцию print() и вашу переменную.
name = 'Mr. Bean'
# Напишите тут ваш код
print('Привет', name)