# Это жизнь

# Вам необходимо отсортировать массив на устройстве с ограниченной памятью, где доступно всего 1 КБ дополнительной памяти.
# Какой алгоритм сортировки вы выберете?  Напишите его.

# Напишите тут ваш код

def in_place_quick_sort(arr, low, high):
# Напишите тут ваш код

# Example usage
arr = [3, 6, 8, 10, 1, 2, 1]
in_place_quick_sort(arr, 0, len(arr) - 1)
print(arr)
