# Сортировка кортежей

# Напишите функцию, которая использует сортировку вставками для сортировки списка кортежей по первому элементу каждого кортежа.


def insertion_sort_tuples(arr):
# Напишите тут ваш код


# Example usage:
tuples_list = [(3, 'c'), (1, 'a'), (2, 'b'), (4, 'd')]
sorted_list = insertion_sort_tuples(tuples_list)
print(sorted_list)
