# Распаковка

# Напишите программу, которая создает кортеж из 3 элементов (например, имя, возраст, город).
# Затем программа должна распаковать кортеж в отдельные переменные и вывести каждую переменную.

# Напишите тут ваш код
tuple1 = ('John', 55, 'New York')
name, age, city = tuple1
print(name, age, city)
