# Большой подмассив

# Дан массив длинны n состоящий из целых чисел.
# Найти минимальный подмассив с суммой элементов, превышающей заданное значение S.


def min_subarray_len(s, nums):
# Напишите тут ваш код

# Пример использования
arr = [2, 3, 1, 2, 4, 3]
S = 7
print(min_subarray_len(S, arr))  # Output: 2 (подмассив [4, 3])
