# Рост дюймах

# Создайте переменную centimeter и присвойте ей ваш рост в сантиметрах.
# Создайте переменную inches и присвойте ей ваш рост в дюймах (1 дюйм == 2.54 см).
# Выведите ваш рост в дюймах на экран

# Напишите тут ваш код

centimeter = 174
inches = 174 / 2.54
print("Your height in  inches is:", inches)