# Решение в лоб

# Написать решение в лоб для подсчёта количества вхождений каждого элемента в массиве.

def count_occurrences(arr):
# Напишите тут ваш код

# Пример использования:
arr = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
print(count_occurrences(arr))
