# Кто хочет добавки?

# Напишите программу, которая создает пустой список, затем запрашивает у пользователя 5 элементов и добавляет их в список с помощью метода append().
# После этого программа должна вывести итоговый список.

# Напишите тут ваш код
my_list = list()
value_1 = input("Enter value 1: ")
value_2 = input("Enter value 2: ")
value_3 = input("Enter value 3: ")
value_4 = input("Enter value 4: ")
value_5 = input("Enter value 5: ")
my_list.append(value_1)
my_list.append(value_2)
my_list.append(value_3)
my_list.append(value_4)
my_list.append(value_5)
print(my_list)