# Сортировка пузырьком

# Напишите функцию, которая использует сортировку пузырьком для сортировки списка строк по их длине.

def bubble_sort_by_length(arr):
# Напишите тут ваш код


# Пример использования
strings = ["apple", "banana", "kiwi", "cherry", "mango"]
sorted_strings = bubble_sort_by_length(strings)
print(sorted_strings)
