# Должен остаться только один

# Удалить дубликаты из отсортированного массива.


def remove_duplicates(sorted_arr):
# Напишите тут ваш код


# Пример использования
sorted_arr = [1, 1, 2, 2, 3, 4, 4, 5]
print(remove_duplicates(sorted_arr))  # Output: [1, 2, 3, 4, 5]
