# Исследование модуля

# Создайте модуль mymodule.py с функцией и переменной.
# Используйте функцию dir(), чтобы получить список всех доступных атрибутов и методов в этом модуле.

# Напишите тут ваш код
import mymodule

print(dir(mymodule))
