# Деление на ноль.

# Напиши программу, которая создает исключение ZeroDivisionError

# Напишите тут ваш код
print(4 / 0)
