# Срезы

# Напишите программу, которая создает список из 10 элементов,
# выводит элементы с третьего по седьмой включительно с использованием срезов
# и выводит последние три элемента списка с использованием отрицательных индексов.

# Напишите тут ваш код
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(my_list[2:7])
print(my_list[-3:])