# Установка пакетов с помощью pip

# Используйте пакетный менеджер pip для установки, обновления и удаления пакетов.
# Выполните следующие шаги:
# Проверьте установлен ли pip.
# Установите пакет requests.
# Установите конкретную версию пакета numpy (версия 1.21.0).
# Обновите пакет requests до последней версии.
# Удалите пакет requests.
# Список всех установленных пакетов.


# Напишите тут ваш код:
# Проверка, установлен ли pip
pip --version
# Установка пакета requests
pip install requests
# Установка конкретной версии numpy
pip install numpy==1.21.0
# Обновление пакета requests до последней версии
pip install --upgrade requests
# Удаление пакета requests
pip uninstall requests
# Список всех установленных пакетов
pip list
