# Ханойские башни

# Задача о Ханойских башнях. Напиши функцию, которая возвращает количество перемещений дисков, если всего дисков n.


def hanoi_moves(n):
# Напишите тут ваш код

# Пример использования
n = 4
print(hanoi_moves(n))  # Вывод: 15
