# Синтаксическая ошибка.

# Напиши программу, которая создает исключение SyntaxError

# Напишите тут ваш код
def example():
    eval("if True print('Hello')")  # Неправильный синтаксис вызывает SyntaxError

example()
