# Сортировка выбором

# Напишите функцию, которая использует сортировку выбором для сортировки списка строк по их длине.

def selection_sort_by_length(strings):
# Напишите тут ваш код

# Пример использования
strings = ["apple", "dog", "banana", "cat", "elephant"]
sorted_strings = selection_sort_by_length(strings)
print(sorted_strings)  # ['dog', 'cat', 'apple', 'banana', 'elephant']
