# Создание множеств.

# Напиши программу, которая создает 5 множеств:
# множество с 0 элементов,
# множество с 1 элементом,
# множество с 5 элементами,
# множество с 100 элементами,
# множество с 1000 элементами

# Напишите тут ваш код
set1 = set()
set2 = {1}
set3 = {1, 2, 3, 4, 5}
set4 = {i for i in range(100)}
set5 = {i for i in range(1000)}
print(set4)