# Welcome

# Выведите на экран любую понравившуюся вам фразу.

# Напишите тут ваш код
print('Hell, Python rush!')