# Ошибка работы с типом.

# Напиши программу, которая создает исключение TypeError

# Напишите тут ваш код
print('name' + 5)
