# Быстрая сортировка

# Напишите функцию, которая реализует алгоритм быстрой сортировки для сортировки массива чисел.

def quick_sort(arr):
# Напишите тут ваш код


# Пример использования
array = [3, 6, 8, 10, 1, 2, 1]
sorted_array = quick_sort(array)
print(sorted_array)
