# Негатив

# Напишите программу, которая запрашивает у пользователя число и проверяет, является ли оно отрицательным.
# Используйте оператор if для проверки.

# Напишите тут ваш код
number = float(input("Enter your number: "))
if number < 0:
    print("negativ")
else:
    print("positiv")