# Мой любимый список

# Напишите программу, которая создает динамический массив (список)
# и демонстрирует его основные операции: добавление, удаление, доступ по индексу и изменение элемента.
# Класс list использовать можно.

# Напишите тут ваш код
arr = []
arr.append(1)
arr.append(2)
arr.append(3)
arr.append(4)
arr[3] = 6
arr.pop(2)
print(arr[0])
print(arr)
