# Поиск строки

# Напишите программу, которая создает список из 10 элементов.
# Программа просит пользователя ввести строку, а потом проверяет - есть она в списке или нет.

# Напишите тут ваш код
my_list = [1, 2, 'test', 4, 5, 6, 7, 8, 9, 10]
str = input("Enter a value: ")
print(str in my_list)
