# Количество элементов

# Напиши функцию, которая пройдет по массиву и подсчитает сколько каких элементов встречается.

def count_elements(arr):
# Напишите тут ваш код

# Пример использования:
arr = [1, 2, 2, 3, 3, 3, 4, 4, 4, 4]
print(count_elements(arr))  # Output: {1: 1, 2: 2, 3: 3, 4: 4}
