# Все подмножества

# Найти все возможные подмножества данного множества.
# Подсказка: Используйте рекурсию.

def find_subsets(s):
# Напишите тут ваш код


# Example usage:
s = {1, 2, 3}
all_subsets = find_subsets(s)
for subset in all_subsets:
    print(subset)
