# Мемеоизация Фибоначчи

# Напишите функцию для вычисления n-го числа Фибоначчи с использованием мемоизации,
# чтобы улучшить производительность по сравнению с простым рекурсивным подходом.


def fibonacci_memo(n, memo={}):
# Напишите тут ваш код


# Пример использования
n = 10
print(f"fibonacci_memo({n}) = {fibonacci_memo(n)}")
