# Кормен

# Выведите на экран текст "Кормен - красавчик"

# Напишите тут ваш код
print("Кормен - красавчик")
