# Ты ему слово, он тебе ссылку

# Напишите программу, которая создает два списка, присваивает один
# из них другой переменной и проверяет, указывают ли обе
# переменные на один и тот же объект.
# Используйте оператор is для проверки ссылок.

# Напишите тут ваш
list1 = [1, 2, 3]
list2 = list1
print(list2 is list1)