# Все не так однозначно.

# Напиши программу, которая делит целое число на целое.
# Выведи на экран тип результата.

# Напишите тут ваш код
print(3 / 20)
print(type(3 / 20))